#### Terraform working directory 🏠: `demo/demo-account/demo-application/resources`
#### Terraform Format and Style 🖌: `success`
#### Terraform Initialization ⚙️: `success`
#### Terraform Plan 📖: `success`
<details><summary>Show Plan</summary>

```hcl
terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.ebs_volumes.module.ebs_volume["ansible-testhost5/sdg"].data.aws_instance.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_instance" "this" {
      + ami                         = (known after apply)
      + arn                         = (known after apply)
      + associate_public_ip_address = (known after apply)
      + availability_zone           = (known after apply)
      + credit_specification        = (known after apply)
      + disable_api_stop            = (known after apply)
      + disable_api_termination     = (known after apply)
      + ebs_block_device            = (known after apply)
      + ebs_optimized               = (known after apply)
      + enclave_options             = (known after apply)
      + ephemeral_block_device      = (known after apply)
      + host_id                     = (known after apply)
      + host_resource_group_arn     = (known after apply)
      + iam_instance_profile        = (known after apply)
      + id                          = (known after apply)
      + instance_state              = (known after apply)
      + instance_tags               = (known after apply)
      + instance_type               = (known after apply)
      + ipv6_addresses              = (known after apply)
      + key_name                    = (known after apply)
      + maintenance_options         = (known after apply)
      + metadata_options            = (known after apply)
      + monitoring                  = (known after apply)
      + network_interface_id        = (known after apply)
      + outpost_arn                 = (known after apply)
      + password_data               = (known after apply)
      + placement_group             = (known after apply)
      + placement_partition_number  = (known after apply)
      + private_dns                 = (known after apply)
      + private_dns_name_options    = (known after apply)
      + private_ip                  = (known after apply)
      + public_dns                  = (known after apply)
      + public_ip                   = (known after apply)
      + root_block_device           = (known after apply)
      + secondary_private_ips       = (known after apply)
      + security_groups             = (known after apply)
      + source_dest_check           = (known after apply)
      + subnet_id                   = (known after apply)
      + tags                        = (known after apply)
      + tenancy                     = (known after apply)
      + user_data                   = (known after apply)
      + user_data_base64            = (known after apply)
      + vpc_security_group_ids      = (known after apply)

      + filter {
          + name   = "tag:Name"
          + values = [
              + "ansible-testhost5",
            ]
        }
    }

  # module.ebs_volumes.module.ebs_volume["ansible-testhost5/sdg"].aws_ebs_volume.this will be created
  + resource "aws_ebs_volume" "this" {
      + arn               = (known after apply)
      + availability_zone = "ap-southeast-1a"
      + encrypted         = true
      + final_snapshot    = false
      + id                = (known after apply)
      + iops              = (known after apply)
      + kms_key_id        = (known after apply)
      + size              = 40
      + snapshot_id       = (known after apply)
      + tags              = {
          + "Name" = "ansible-testhost5/sdg"
        }
      + tags_all          = {
          + "Name" = "ansible-testhost5/sdg"
        }
      + throughput        = (known after apply)
      + type              = "gp3"
    }

  # module.ebs_volumes.module.ebs_volume["ansible-testhost5/sdg"].aws_volume_attachment.this[0] will be created
  + resource "aws_volume_attachment" "this" {
      + device_name = "sdg"
      + id          = (known after apply)
      + instance_id = (known after apply)
      + volume_id   = (known after apply)
    }

  # module.ec2_instances.module.ec2_instance["test-host"].aws_ebs_volume.this["/dev/sdf"] will be created
  + resource "aws_ebs_volume" "this" {
      + arn               = (known after apply)
      + availability_zone = (known after apply)
      + encrypted         = true
      + final_snapshot    = false
      + id                = (known after apply)
      + iops              = (known after apply)
      + kms_key_id        = (known after apply)
      + size              = 40
      + snapshot_id       = (known after apply)
      + tags              = {
          + "Name" = "test-host/sdf"
        }
      + tags_all          = {
          + "Name" = "test-host/sdf"
        }
      + throughput        = (known after apply)
      + type              = "gp3"
    }

  # module.ec2_instances.module.ec2_instance["test-host"].aws_ec2_tag.instance["Name"] will be created
  + resource "aws_ec2_tag" "instance" {
      + id          = (known after apply)
      + key         = "Name"
      + resource_id = (known after apply)
      + value       = "test-host"
    }

  # module.ec2_instances.module.ec2_instance["test-host"].aws_ec2_tag.instance["test-tag"] will be created
  + resource "aws_ec2_tag" "instance" {
      + id          = (known after apply)
      + key         = "test-tag"
      + resource_id = (known after apply)
      + value       = "little kitty eat cookies"
    }

  # module.ec2_instances.module.ec2_instance["test-host"].aws_ec2_tag.rbd["Name"] will be created
  + resource "aws_ec2_tag" "rbd" {
      + id          = (known after apply)
      + key         = "Name"
      + resource_id = (known after apply)
      + value       = "test-host/root"
    }

  # module.ec2_instances.module.ec2_instance["test-host"].aws_instance.this will be created
  + resource "aws_instance" "this" {
      + ami                                  = "ami-0896ef7bec0d0e792"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = false
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = false
      + disable_api_termination              = false
      + ebs_optimized                        = false
      + get_password_data                    = false
      + hibernation                          = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "EC2-test-role"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = "stop"
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = 0
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = false
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = 0
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = false
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-082bb69d2c09645c4"
      + tags_all                             = (known after apply)
      + tenancy                              = (known after apply)
      + user_data                            = "1bc10f7c8b865e9023e58f323d0ebd12a8a33ec9"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-033e4644ca8d5401d",
        ]

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "optional"
          + instance_metadata_tags      = "disabled"
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 10
          + volume_type           = "gp3"
        }
    }

  # module.ec2_instances.module.ec2_instance["test-host"].aws_volume_attachment.this["/dev/sdf"] will be created
  + resource "aws_volume_attachment" "this" {
      + device_name = "/dev/sdf"
      + id          = (known after apply)
      + instance_id = (known after apply)
      + volume_id   = (known after apply)
    }

Plan: 8 to add, 0 to change, 0 to destroy.

```

</details>

**Pusher**: @bitzhouwen
**Action**: pull_request
